# CanSetValue Method (ElementId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillSchemeEntry..::..CanSetValue Method (ElementId)
ColorFillSchemeEntry Class See Also
---
Checks whether StorageType of entry is ElementId.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool CanSetValue(
	ElementId value
)
```

Visual Basic
---
```text
Public Function CanSetValue ( _
	value As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool CanSetValue(
	ElementId^ value
)
```

# ### Parameters
value
    Type: Autodesk.Revit.DB..::..ElementId New ElementId value.
# ### Return Value
True if StorageType of the entry is ElementId and the entry, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ColorFillSchemeEntry Class
CanSetValue Overload
Autodesk.Revit.DB Namespace